In [9]:
import pandas as pd
import numpy as np

In [4]:
# Crear un DataFrame a partir de un diccionario
data = {'NOMBRES':['Maria', 'Jose', 'Ana', 'Pedro'],
        'CARRERAS':['FISICA', 'MATEMATICAS', 'FISICA', 'MATEMATICAS'],
        'CORREOS':['maria@gmai.com', 'jose@gmai.com', 'ana@gmai.com', 'pedro@gmai.com']}

In [6]:
estudiantes = pd.DataFrame(data)
estudiantes

  NOMBRES     CARRERAS         CORREOS
0   Maria       FISICA  maria@gmai.com
1    Jose  MATEMATICAS   jose@gmai.com
2     Ana       FISICA    ana@gmai.com
3   Pedro  MATEMATICAS  pedro@gmai.com

In [8]:
# Crear un DataFrame a partir de una lista de listas
df = pd.DataFrame([['Maria',27],['Jose',30],['Ana',25],['Pedro',28]],
                  columns=['NOMBRES','EDADES'])
df

  NOMBRES  EDADES
0   Maria      27
1    Jose      30
2     Ana      25
3   Pedro      28

In [11]:
# Crear un DataFrame a partir de un array de numpy
df2=pd.DataFrame(np.random.randn(4,3),columns=['A','B','C'])
df2

          A         B         C
0 -0.682007  0.145978 -0.267465
1  0.119776  0.156934  1.469450
2  0.057045 -0.599408 -0.854228
3  0.768417 -1.243614 -0.936832